from .Utils import (
   get_filter_results,
   get_file_details,
   is_subscribed,
   get_poster,
   Media
)
from .Channel import (
   RATING,
   GENRES
)

HELP = """
Bᴀsɪᴄ Cᴏᴍᴍᴀᴅs

/start :- ᴄʜᴇᴄᴋ ᴀᴍ Aʟɪᴠᴇ

Bᴏᴛ Oᴡɴᴇʀ Oɴʟʏ
/broadcast Rᴇᴘʟᴀʏ Aɴʏ Mᴇssᴀɢᴇ ᴏʀ Mᴇᴅɪᴀ
/stats ᴜsᴇʀ Sᴛᴀᴛᴜs
/ban_user  ᴄʟɪᴄᴋ ʙᴀɴ_ᴜsᴇʀ ᴍᴏʀᴇ ɪɴғᴏ
/unban_user ᴄʟɪᴄᴋ ᴜɴʙᴀɴ_ᴜsᴇʀ ᴍᴏʀᴇ ɪɴғᴏ
/banned_users Bᴀɴɴᴇᴅ Usᴇʀ Dᴇᴛᴀɪʟs
/total Hᴏᴡ Mᴀɴʏ Fɪʟᴇs Aᴅᴅᴇᴅ Iɴ Dᴀᴛᴀʙᴀsᴇ
/logger  Gᴇᴛ Lᴏɢs
/delete Dᴇʟᴇᴛᴇ Fɪʟᴇ Fʀᴏᴍ Dᴀᴛᴀʙᴀsᴇ

"""

ABOUT = """
❍ ɴᴀᴍᴇ:  Aᴜᴛᴏ Fɪʟᴛᴇʀ V𝟹
❍ ᴄʀᴇᴀᴛᴏʀ : [ᴅᴀʀᴋ ʟᴏʀᴅ](HTTPS://T.ME/VAMPIRE_KING_NO_1)
❍ ᴇᴅɪᴛᴏʀ : [ᴅᴀʀᴋ ᴀɴɢᴇʟ](HTTPS://T.ME/DARKZ_ANGEL)
❍ ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ3
❍ ʟɪʙʀᴀʀʏ : ᴘʏʀᴏɢʀᴀᴍ ᴀsʏɴᴄɪᴏ 1.13.0
❍ sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ : [ᴄʟɪᴄᴋ ʜᴇʀᴇ](https://t.me/NOKIERUNNOIPPKITTUM)
"""
